export const wordsAPI = [
  "дом",
  "кот",
  "собака",
  "книга",
  "окно",
  "стол",
  "компьютер",
  "человек",
  "мышь",
  "гитара",
  "автомобиль",
  "зонт",
  "планета",
  "звезда",
  "птица",
  "рыба",
  "медведь",
  "луна",
  "солнце",
  "корабль",
  "телефон",
  "молоко",
  "мед",
  "дерево",
  "цветок",
  "земля",
  "вода",
  "огонь",
  "воздух",
  "снег",
  "лиса",
  "слон",
  "шапка",
  "красный",
  "город",
  "дорога",
  "парк",
  "фильм",
  "музыка",
  "концерт",
  "каникулы",
  "учитель",
  "праздник",
  "магазин",
  "банк",
  "бутылка",
  "печь",
  "кресло",
  "подушка",
  "карандаш",
  "праздник",
  "лампа",
  "платье",
  "носки",
  "шарф",
  "сумка",
  "ручка",
  "часы",
  "браслет",
  "перчатки",
  "солнцезащитные очки",
  "пиджак",
  "юбка",
  "брюки",
  "туфли",
  "сапоги",
  "шорты",
  "пиджак",
  "рубашка",
  "пальто",
  "пояс",
  "котенок",
  "рыцарь",
  "дракон",
  "магия",
  "волшебник",
  "замок",
  "дракон",
  "деньги",
  "банкомат",
  "шоколад",
  "мороженое",
  "конфеты",
  "торт",
  "пирог",
  "море",
  "озеро",
  "река",
  "водопад",
  "горы",
  "пляж",
  "пустыня",
  "лес",
  "поляна",
  "трава",
  "цветы",
  "шарик",
  "игрушка",
  "конструктор",
  "кукла",
  "мяч",
  "велосипед",
  "скейтборд",
  "лыжи",
  "сноуборд",
  "книжка",
  "журнал",
  "газета",
  "телефон",
  "компьютер",
  "телевизор",
  "пульт",
];

console.log(wordsAPI);

export const shuffle = (array) => {
  let newArray = array.slice(); // Создаем копию исходного массива
  let currentIndex = newArray.length;
  let temporaryValue, randomIndex;

  // Пока остаются элементы для перемешивания
  while (currentIndex !== 0) {
    // Выбираем случайный индекс
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;

    // Меняем местами элементы
    temporaryValue = newArray[currentIndex];
    newArray[currentIndex] = newArray[randomIndex];
    newArray[randomIndex] = temporaryValue;
  }

  return newArray;
}


export const wordsArray = shuffle(wordsAPI)






