export const words = [
  'кот',
  'дом',
  'солнце',
  'море',
  'лес',
  'цветок',
  'яблоко',
  'книга',
  'школа',
  'друг',
  'мама',
  'папа',
  'день',
  'ночь',
  'ветер',
  'дождь',
  'зима',
  'лето',
  'осень',
  'снег',
  'дерево',
  'поле',
  'чашка',
  'молоко',
  'печь',
  'окно',
  'дверь',
  'трава',
  'песок',
  'птица',
  'рыба',
  'корабль',
  'самолет',
  'машина',
  'велосипед',
  'красный',
  'синий',
  'зеленый',
  'желтый',
  'белый',
  'черный',
  'оранжевый',
  'фиолетовый',
  'круг',
  'треугольник',
  'квадрат',
  'прямоугольник',
  'звезда',
  'сердце'
];


  // const teamList =  [
  //   { name: "Красные", avatar: "cat.png", people: [], color: "#ff6347", score: 0 },
  //   { name: "Синие", avatar: "chick.png", people: [], color: "#0096ff", score: 0 },
  // ]

  // teamList[0]['oct'] = '123'


  // console.log(teamList[0]);